{
  "customers": [
    {
      "accountName": "Toshiba US",
      "legalEntity": "Toshiba America, Inc.",
      "context": "Provides comprehensive Energy, Industrial, and Electronics Solutions across the Americas. Develops advanced power generation and decarbonization technologies, industrial innovations, and semiconductor/data storage solutions."
    },
    {
      "accountName": "Airbnb",
      "legalEntity": "Airbnb, Inc.",
      "context": "Operates a global online marketplace connecting hosts and guests for unique stays and experiences. Offers a wide range of accommodations, from homes to unique stays, alongside curated local experiences and services."
    },
    {
      "accountName": "Salesforce",
      "legalEntity": "Salesforce, Inc.",
      "context": "Provides the #1 AI CRM platform to help companies build and improve customer relationships. Offers integrated apps for sales, service, marketing, commerce, and IT, powered by data tools and AI."
    },
    {
      "accountName": "Dropbox",
      "legalEntity": "Dropbox, Inc.",
      "context": "Provides cloud storage, file hosting, and content collaboration tools. Offers AI-powered features for smarter search, drafting, and organization. Serves individuals, teams, and businesses with a focus on simplifying workflows and securing data."
    },
    {
      "accountName": "Duracell",
      "legalEntity": "Duracell U.S. Operations, Inc.",
      "context": "Manufactures and sells alkaline batteries, specialty cells, and rechargeable batteries. Serves consumers and businesses globally with its battery products. Recognized as a leading brand for quality, dependability, and innovation in battery technology."
    },
    {
      "accountName": "Cargill",
      "legalEntity": "Cargill, Incorporated",
      "context": "Provides food, agriculture, financial, and industrial products and services. Acts as a partner in the global supply chain, connecting producers and customers. Focuses on nourishing the world safely, responsibly, and sustainably."
    },
    {
      "accountName": "Chevron",
      "legalEntity": "Chevron Corporation",
      "context": "Engages in integrated energy and chemicals operations, including exploration, production, refining, and marketing of oil, natural gas, and petrochemicals. Focuses on advancing technology to deliver current energy needs and build the lower-carbon energy system of the future."
    },
    {
      "accountName": "Coherent",
      "legalEntity": "Coherent Corp.",
      "context": "Develops, manufactures, and markets engineered materials, optoelectronic components, and lasers. Serves diverse markets including industrial, optical communications, semiconductor equipment, life sciences, and consumer electronics."
    },
    {
      "accountName": "DHL",
      "legalEntity": "Deutsche Post AG",
      "context": "Offers a comprehensive portfolio including parcel, express, freight transport, supply chain management, and e-commerce logistics solutions. Operates as the world's leading logistics company, connecting people and markets and enabling global trade across over 220 countries and territories."
    },
    {
      "accountName": "ECMS",
      "legalEntity": "BASF Environmental Catalyst and Metal Solutions LLC",
      "context": "Provides international logistics services including courier, forwarding, and warehousing, leveraging global networks and advanced IT. Specializes in cross-border e-commerce, offering low-cost, technology-driven, and customized solutions for over 50 industries worldwide."
    },
    {
      "accountName": "Graybar Electric",
      "legalEntity": "Graybar Electric Company, Inc.",
      "context": "Leading North American distributor of electrical, communications, data networking, industrial, and automation products. Specializes in supply chain management and logistics services. Serves customers in construction, commercial, institutional, government, industrial, and utility markets."
    },
    {
      "accountName": "IQVIA",
      "legalEntity": "IQVIA Holdings Inc.",
      "context": "Provides data, analytics, technology, and services to the life sciences and healthcare industries. Offers clinical research, commercial insights, real-world evidence, and healthcare intelligence solutions. Supports pharmaceutical, biotechnology, and MedTech companies in accelerating innovation."
    },
    {
      "accountName": "Aramark Ireland",
      "legalEntity": "Aramark Ireland Holdings Limited",
      "context": "Provides food service, facilities management, property services, and retail solutions. Serves clients across sectors including healthcare, education, business and industry, sports and entertainment, and government. Operates as the largest dedicated property management company in Ireland."
    },
    {
      "accountName": "CHS",
      "legalEntity": "CHS Inc.",
      "context": "A diversified global agribusiness cooperative owned by farmers and member cooperatives, operating in energy, agronomy, grains, and foods. Supplies energy products, crop inputs, grain marketing, animal nutrition, food ingredients, and risk management services."
    },
    {
      "accountName": "Ecolab",
      "legalEntity": "Ecolab Inc.",
      "context": "Provides water, hygiene, and infection prevention solutions and services. Serves customers in over 40 industries to advance food safety, maintain clean environments, and optimize water and energy use. Operates as a global sustainability leader."
    },
    {
      "accountName": "Fox",
      "legalEntity": "Fox Corporation",
      "context": "Produces and distributes compelling news, sports, and entertainment content through iconic domestic brands. Key brands include FOX News Media, FOX Sports, Tubi Media Group, FOX Entertainment, and FOX Television Stations."
    },
    {
      "accountName": "Gilead Sciences",
      "legalEntity": "GILEAD SCIENCES, INC.",
      "context": "Discovers, develops, and commercializes innovative medicines for unmet medical needs. Focuses on therapeutic areas including HIV/AIDS, liver diseases, cancer, inflammation, and serious respiratory and cardiovascular conditions."
    },
    {
      "accountName": "Intuit",
      "legalEntity": "Intuit Inc.",
      "context": "Provides financial software and services including TurboTax, Credit Karma, QuickBooks, and Mailchimp. Aims to help consumers and small businesses manage their finances, save time, and make confident financial decisions. Serves approximately 100 million customers worldwide."
    },
    {
      "accountName": "Northern Trust Management Services",
      "legalEntity": "Northern Trust Management Services Ltd",
      "context": "Operates as an investment advisory firm. Provides asset and fund administration, fiduciary, and banking solutions. Serves successful individuals, families, and institutions globally."
    },
    {
      "accountName": "Petsmart",
      "legalEntity": "PetSmart LLC",
      "context": "Operates as a pet superstore and the largest omni-channel pet retailer in North America. Offers a wide range of pet food, products, and accessories for dogs, cats, birds, fish, reptiles, and small animals. Provides services including dog training, pet grooming, pet boarding, Doggie Day Camp, and operates veterinary hospitals."
    },
    {
      "accountName": "ServiceNow",
      "legalEntity": "ServiceNow, Inc.",
      "context": "Delivers a cloud-based platform (Now Platform) to digitize and automate enterprise workflows with AI. Connects AI, data, and workflows to reinvent business operations and enhance employee and customer experiences. Acts as an AI control tower for business reinvention."
    },
    {
      "accountName": "Meta",
      "legalEntity": "Meta Platforms, Inc.",
      "context": "Develops technology for social connection, community building, and business growth, including VR/AR experiences and the metaverse. Operates the Family of Apps segment, selling advertising placements on platforms like Facebook and Instagram."
    },
    {
      "accountName": "Bayer",
      "legalEntity": "Bayer Aktiengesellschaft",
      "context": "Global life science company with core competencies in health care and agriculture. Operates three divisions: Pharmaceuticals (prescription products, radiology), Consumer Health (self-care products), and Crop Science (seeds, crop protection)."
    },
    {
      "accountName": "TikTok",
      "legalEntity": "TikTok USDS Joint Venture LLC",
      "context": "Develops and operates a short-form mobile video application for creative expression and community engagement. Provides a global platform for users to create, view, interact with, and share content. Operates e-commerce, marketing, and advertising services in the U.S. under specific regulatory safeguards."
    },
    {
      "accountName": "OpenAI",
      "legalEntity": "OpenAI, Inc.",
      "context": "Conducts AI research and development, focusing on creating artificial general intelligence (AGI). Aims to ensure AGI benefits all of humanity, prioritizing safety and alignment with human values. Develops AI technologies and platforms to support businesses, enterprises, and developers."
    }
  ],
  "lastUpdated": "2026-02-03",
  "source": "Signed Logos - Overview and Legal Entity.xlsx (Companies sheet)"
}
